Catalogs/ВидыДокументовРасчетаВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовРасчетаВыработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Розница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыДокументовРасчетаВыработки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	// Производство 
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.ЗаказПокупателя.ПолучитьОбъект();
	ВидОбъект.Производство = Истина;
	ВидОбъект.Записать();
	
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.РеализацияТоваровИУслуг.ПолучитьОбъект();
	ВидОбъект.Производство = Истина;
	ВидОбъект.Записать();
	
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.ВыпускПродукции.ПолучитьОбъект();
	ВидОбъект.Производство = Истина;
	ВидОбъект.Записать();
	
	// Розница	
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.Лид.ПолучитьОбъект();
	ВидОбъект.Розница = Истина;
	ВидОбъект.Записать();
	
	ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.Монтаж.ПолучитьОбъект();
	ВидОбъект.Розница = Истина;
	ВидОбъект.Записать();
	
	//ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.Продажа.ПолучитьОбъект();
	//ВидОбъект.Розница = Истина;
	//ВидОбъект.Записать();
	//
	//ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.Рекламация.ПолучитьОбъект();
	//ВидОбъект.Розница = Истина;
	//ВидОбъект.Записать();
	//
	//ВидОбъект = Справочники.ВидыДокументовРасчетаВыработки.СервиснаяЗаявка.ПолучитьОбъект();
	//ВидОбъект.Розница = Истина;
	//ВидОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
